Terraform Plan Output:
```
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=f3310d07-c633-44f8-a208-b0db62357c69]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=sachin-raghuwanshi-99]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_2d5bf6e7-eb38-4b8a-b7f2-9f5fc293fdb7.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-sachin-raghuwanshi-99]
module.appcd_9f000f42-f8ce-401e-8607-18f71332a72a.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=sachin-raghuwanshi-99]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=sachin-raghuwanshi-99]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=sachin-raghuwanshi-99]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ arn                            = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ code_sha256                    = "ThpXeTZobED3ATPn7m4pXZIgyOEqiZM/qo5OX/My6zE=" -> (known after apply)
      ~ function_name                  = "hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> "hello-kitty-function-sachin-raghuwanshi-99" # forces replacement
      ~ id                             = "hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays/invocations" -> (known after apply)
      ~ last_modified                  = "2024-09-28T09:51:25.565+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 2168 -> (known after apply)
        tags                           = {
            "appstack"  = "SachinR-hello-kitty-demo"
            "component" = "hello-kitty"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "Sachin-Raghuwanshi-DEVInfraDays" -> "sachin-raghuwanshi-99"
            }
        }

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
      ~ function_arn       = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ function_name      = "hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> "hello-kitty-function-sachin-raghuwanshi-99" # forces replacement
      ~ function_url       = "https://4vope6pwfxiyo6whn3veldkrdq0proly.lambda-url.us-west-2.on.aws/" -> (known after apply)
      ~ id                 = "hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ url_id             = "4vope6pwfxiyo6whn3veldkrdq0proly" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.appcd_2d5bf6e7-eb38-4b8a-b7f2-9f5fc293fdb7.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays:Writer" -> (known after apply)
        name        = "Writer"
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays:*",
                        ]
                      - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> "hello-kitty-role-sachin-raghuwanshi-99" # forces replacement
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ id                = "/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> "/aws/lambda/hello-kitty-function-sachin-raghuwanshi-99" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "appstack"  = "SachinR-hello-kitty-demo"
            "component" = "hello-kitty"
        }
        # (4 unchanged attributes hidden)
    }

  # module.appcd_9f000f42-f8ce-401e-8607-18f71332a72a.aws_iam_role_policy.this must be replaced
-/+ resource "aws_iam_role_policy" "this" {
      ~ id          = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays:aws_s3-hello-kitty-policy" -> (known after apply)
        name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      ~ role        = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> "hello-kitty-role-sachin-raghuwanshi-99" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::222634395437:role/hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ create_date           = "2024-09-28T09:51:15Z" -> (known after apply)
      ~ id                    = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> "hello-kitty-role-sachin-raghuwanshi-99" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "appstack"  = "SachinR-hello-kitty-demo"
            "component" = "hello-kitty"
        }
      ~ unique_id             = "AROATHVQLI4W2CA73KI7X" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "Writer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e50"
                        },
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays:*",
                            ]
                          - Sid      = "CloudWatchLogGroup86ec452a770a59bf87dd67ed883e25e51"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "aws_s3-hello-kitty-policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:Encrypt",
                              - "kms:GenerateDataKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:kms:us-west-2:222634395437:key/f3310d07-c633-44f8-a208-b0db62357c69",
                            ]
                          - Sid      = "AllowKmsAccess"
                        },
                      - {
                          - Action   = [
                              - "s3:PutObject",
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::sachin-raghuwanshi-99",
                              - "arn:aws:s3:::sachin-raghuwanshi-99/*",
                            ]
                          - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_arn            = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_name           = "/aws/lambda/hello-kitty-function-sachin-raghuwanshi-99"
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_arn  = "arn:aws:logs:us-west-2:222634395437:log-group:/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> null
  - aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_name = "/aws/lambda/hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> null
  + aws_iam_role_hello_kitty_role_sachin_raghuwanshi_99_arn                                       = (known after apply)
  + aws_iam_role_hello_kitty_role_sachin_raghuwanshi_99_name                                      = "hello-kitty-role-sachin-raghuwanshi-99"
  - aws_iam_role_hello_kitty_role_sachin_raghuwanshi_devinfradays_arn                             = "arn:aws:iam::222634395437:role/hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> null
  - aws_iam_role_hello_kitty_role_sachin_raghuwanshi_devinfradays_name                            = "hello-kitty-role-Sachin-Raghuwanshi-DEVInfraDays" -> null
  + aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_function_arn                            = (known after apply)
  + aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_function_name                           = "hello-kitty-function-sachin-raghuwanshi-99"
  + aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_function_url                            = (known after apply)
  + aws_lambda_hello_kitty_function_sachin_raghuwanshi_99_invoke_arn                              = (known after apply)
  - aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_function_arn                  = "arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> null
  - aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_function_name                 = "hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays" -> null
  - aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_function_url                  = "https://4vope6pwfxiyo6whn3veldkrdq0proly.lambda-url.us-west-2.on.aws/" -> null
  - aws_lambda_hello_kitty_function_sachin_raghuwanshi_devinfradays_invoke_arn                    = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:222634395437:function:hello-kitty-function-Sachin-Raghuwanshi-DEVInfraDays/invocations" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```